app/Http/Controllers/Admin/ActorController.php

    public function index(): View
    {
        $actors = Actor::query()->latest();

        if ($keyword = request('search'))
            $actors->where('full_name', "LIKE", "%{$keyword}%");

        $actors = $actors->paginate(15);
---
select * from `actors` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `actors`