app/Http/Controllers/Admin/CategoryController.php

select * from `categories` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `categories`
---
    public function index()
    {
        $categories = Category::latest();

        if ($keyword = request('search'))
            $categories->where('name', "LIKE", "%{$keyword}%");

        $categories = $categories->paginate(15);