app/Http/Controllers/Admin/CommentController.php

select * from `comments` order by `created_at` desc limit 16 offset 0
---
    public function index()
    {
        $comments = Comment::orderby('created_at', 'desc')->simplePaginate(15);

update `comments` set `is_approved` = 1, `comments`.`updated_at` = '2023-03-12 13:59:26' where `id` = 3
---
    public function approved(Comment $comment)
    {
        $comment->is_approved = $comment->is_approved == 0 ? 1 : 0;
        $result = $comment->save();