app/Http/Controllers/Admin/SeriesController.php

    public function index()
    {
        $allSeries = Series::latest()->paginate(10);
---
select * from `series` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `series`