app/Http/Controllers/Admin/SliderController.php

select * from `sliders` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `sliders`
---
    public function index()
    {
        $sliders = Slider::query();

        if ($searchString = request('search'))
            $sliders->where('alt', "LIKE" , "%{$searchString}%");

        if (request('status'))
            $sliders->wherePublished();

        $sliders = $sliders->latest()->paginate(15);

insert into `sliders` (`title`, `description`, `url`, `status`, `image`, `updated_at`, `created_at`) values ('the 100', '<p>the 100</p>', '', '1', 'images\content\slider\2023\03\12\1678607329.jpg', '2023-03-12 07:48:49', '2023-03-12 07:48:49')
---
    public function store(SliderRequest $request , ImageService $imageService)
    {

        DB::transaction(function () use($request , $imageService) {
            $inputs = $request->all();

            // save image
            if ($request->hasFile('image')) {
                $imageService->setExclusiveDirectory('images' . DIRECTORY_SEPARATOR . "content" . DIRECTORY_SEPARATOR . "slider-top");
                $inputs['image'] = $imageService->save($inputs['image']);
            }

            $slider = Slider::create($inputs);